app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "this is atitle"], ["text", "this is a text"], ["created_at", "2019-07-19 16:21:39.505427"], ["updated_at", "2019-07-19 16:21:39.505427"]]
---
  def create
    @article = Article.new(params.require(:article).permit(:title, :text))

    @article.save